-- 
--[[
---> 业务路由
--------------------------------------------------------------------------
---> 参考文献如下
-----> /
-----------------------------------------------------------------------------------------------------------------
--[[
---> 统一函数指针
--]]
--------------------------------------------------------------------------
local require = require
local s_format = string.format

-----------------------------------------------------------------------------------------------------------------

return function(app, conf, store)

    ---> 控制路由是否采用严格模式匹配，即是否严格区分’/test’和’/test/‘
    ---> 相关参考：http://lor.sumory.com/guide/strict_route.html
    app:conf("strict_route", false)
    
    return require(s_format("app.routes.mode.%s", conf.view_conf.mode))(app, conf, store)
end